#!/usr/bin/python3
#Пользователь вводит свое имя, поздороваться с ним по имени

name = input('Введите имя: ')
print('Hello, ' + name + '!')
